Repository: hrietmann/URL-Shortener
Catalog: URL Shortener/*.lproj/Localizable.strings
Languages: de, fr, it

# ShortenLinksView.textfield.placeholder
source: Enter the link to shorten
de: Geben Sie den Link ein, um zu verkürzen
fr: Entrez le lien pour raccourcir
it: Inserisci il link per abbreviare

# ShortenLinkRow.Accessibility.Button
source: Shortened url %@ created from the original url of %@ at %@
de: Verkürzte URL %@ erstellt aus der ursprünglichen URL von %@ unter %@
fr: URL raccourcie %@ créée à partir de l'URL originale de %@ le %@
it: URL abbreviato %@ creato dall'url originale di %@ a %@

# AppError.genericError.title
source: Error
de: Fehler
fr: Erreur
it: Errore

# AppError.genericError.message
source: Something went wrong: %@
fr: Quelque chose s'est mal passé : %@
it: Qualcosa è andato storto: %@

# AppError.invalidOrginalURLLink.title
source: Invalid URL
de: Ungültige URL
fr: URL non valide
it: URL non valido

# AppError.invalidOrginalURLLink.message
source: Unable to recognize the link given as a URL. Please verify the link entered. Link given: '%@'
de: Der als URL angegebene Link kann nicht erkannt werden. Bitte überprüfen Sie den eingegebenen Link. Link angegeben: '%@'
fr: Impossible de reconnaître le lien donné comme URL. Veuillez vérifier le lien entré. Lien donné : '%@'
it: Impossibile riconoscere il link dato come URL. Verifica il link inserito. Link fornito: '%@'

# AppError.badlyFormattedShortenURL.title
source: Internal error
de: Interner Fehler
fr: Erreur interne
it: Errore interno

# AppError.badlyFormattedShortenURL.message
source: The shorten URL returned from our backend services returned a badly formated URL (returned '%@'). We are looking forward to fix the issue. Please try again later.
de: Die von unseren Backend-Diensten zurückgegebene verkürzte URL gab eine schlecht formatierte URL zurück (zurückgegeben '%@'). Wir freuen uns darauf, das Problem zu beheben. Bitte versuchen Sie es später noch einmal.
fr: L'URL abrégée renvoyée par nos services d'arrière-plan a renvoyé une URL mal formatée '%@'. Nous faisons notre maximum pour résoudre le problème. Veuillez réessayer plus tard.
it: L'URL abbreviato restituito dai nostri servizi di backend ha restituito un URL mal formato (restituito '%@'). Non vediamo l'ora di risolvere il problema. Riprova più tardi.

# AppError.noShortenURLGiven.title
source: Internal error
de: Interner Fehler
fr: Erreur interne
it: Errore interno

# AppError.noShortenURLGiven.message
source: Our services did not returned any shorten URL for the URL you've entered. We are looking forward to fix this issue as quickly as possible. Please retry later.
de: Unsere Dienste haben keine verkürzte URL für die von Ihnen eingegebene URL zurückgegeben. Wir freuen uns darauf, dieses Problem so schnell wie möglich zu beheben. Bitte versuchen Sie es später noch einmal.
fr: Nos services n'ont renvoyé aucune URL raccourcie pour l'URL que vous avez saisie. Nous sommes impatients de résoudre ce problème le plus rapidement possible. Veuillez réessayer plus tard.
it: I nostri servizi non hanno restituito alcun URL abbreviato per l'URL che hai inserito. Non vediamo l'ora di risolvere questo problema il prima possibile. Riprova più tardi.

# AppError.shortenURLProviderRemovedFromMemory.title
source: Memory issue
de: Speicherproblem
fr: Problème de mémoire
it: Problema di memoria

# AppError.shortenURLProviderRemovedFromMemory.message
source: The ongoing task has been canceled.
de: Die laufende Aufgabe wurde abgebrochen.
fr: La tâche en cours a été annulée.
it: Il compito in corso è stato annullato.

# AppError.badResponseReceived.title
source: Request error
de: Fehler anfordern
fr: Erreur de demande
it: Errore di richiesta

# AppError.badResponseReceived.message
source: Our services returned an error with code %@. We are actively working on fixing it. Please try again later.
de: Unsere Dienste haben einen Fehler mit dem Code %@ zurückgegeben. Wir arbeiten aktiv daran, es zu beheben. Bitte versuchen Sie es später noch einmal.
fr: Nos services ont renvoyé une erreur avec le code %@. Nous travaillons activement à le réparer. Veuillez réessayer plus tard.
it: I nostri servizi hanno restituito un errore con il codice %@. Stiamo lavorando attivamente per risolverlo. Riprova più tardi.

# AppError.linkAlreadyShortened.title
source: Already exists
de: Existiert bereits
fr: Existe déjà
it: Esiste già

# AppError.linkAlreadyShortened.message
source: This url is already shortened to '%@' from the original '%@'. Try another URL to shorten.
de: Diese URL ist bereits vom ursprünglichen '%@' auf '%@' gekürzt. Versuchen Sie es mit einer anderen URL, um sie zu verkürzen.
fr: Cette URL est déjà raccourcie à '%@' par rapport à l'%@'original. Essayez une autre URL à raccourcir.
it: Questo URL è già abbreviato in '%@' dall'originale '%@'. Prova un altro URL da abbreviare.
